using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace Langua.Migrations
{
    /// <inheritdoc />
    public partial class addB1B2RUTexts : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Texts",
                columns: new[] { "Id", "Language", "LanguageText", "Level", "TextTitle" },
                values: new object[,]
                {
                    { 41, "Russian", "Русская кухня — одна из самых разнообразных и интересных в мире. В ней сочетаются старинные традиции, простые ингредиенты и уникальные вкусы.\r\n\r\nОснову русской кухни составляют блюда из картофеля, капусты, мяса, рыбы и круп, особенно гречки. Например, борщ — это знаменитый суп из свёклы, капусты и мяса, который подаётся со сметаной. Щи — ещё один популярный суп, приготовленный из квашеной капусты.\r\n\r\nНа завтрак русские часто едят кашу — овсяную, гречневую или манную. Также очень популярны блины с мёдом, вареньем или сметаной. В праздники пекут пироги с разной начинкой: мясом, грибами, картошкой, капустой или сладкими ягодами.\r\n\r\nНа ужин обычно подают горячее блюдо: жареную картошку, котлеты, рыбу или плов. В деревнях до сих пор готовят в русской печи, придавая блюдам особый вкус.\r\n\r\nОсобенное место в русской кухне занимает чай. Его пьют в любое время дня, часто с вареньем, печеньем или пряниками. Самовар — символ русского чаепития.\r\n\r\nРусская кухня — это часть культуры и истории страны. Она объединяет людей за одним столом и передаётся из поколения в поколение.", "B1", "Русская кухня" },
                    { 42, "Russian", "Я просыпаюсь очень рано — в шесть утра — по звонку будильника. Сначала я заправляю кровать, умываюсь, чищу зубы и готовлю себе завтрак. Обычно я предпочитаю плотный и сытный завтрак, чтобы энергии хватило на весь день. Сегодня я приготовил яичницу с беконом и сделал бутерброд с сыром. По утрам я всегда пью чёрный бодрящий кофе. Я не люблю сладкое, поэтому никогда не добавляю сахар.\r\n\r\nПосле завтрака я одеваюсь и выхожу на прогулку с собакой. Мы гуляем в ближайшем парке. Там я делаю лёгкую зарядку: растягиваюсь, делаю пару упражнений и дышу свежим воздухом. Это помогает проснуться и настроиться на рабочий день.\r\n\r\nПотом я возвращаюсь домой, собираю сумку и иду на работу. Я работаю недалеко от дома, продавцом в продуктовом магазине. Мне очень удобно, потому что не нужно тратить много времени на дорогу в метро или стоять в пробках. В девять утра я прихожу на работу, здороваюсь с коллегами и начинаю свой рабочий день.", "B1", "Моё утро" },
                    { 43, "Russian", "Меня зовут Артём. Мне семнадцать лет. Я живу в России, в городе Екатеринбург. Это большой и красивый город на Урале.\r\n\r\nДва года назад мы с родителями переехали в новый район. Теперь мы живём на улице Ленина, дом 24, квартира 12. Наш дом рядом с парком, и я часто гуляю там с друзьями. Мы катаемся на велосипедах, играем в футбол и просто болтаем. Недавно я начал заниматься скейтбордингом — это моё новое хобби.\r\n\r\nВ моей семье четверо человек: мама, папа, я и моя младшая сестра Лиза. Ей девять лет. Я хорошо с ней лажу, иногда помогаю делать уроки. Мы с папой любим смотреть футбол по выходным, а с мамой я часто готовлю ужин — особенно пасту и салаты.\r\n\r\nЯ учусь в выпускном классе. В будущем хочу стать архитектором. Мне нравится рисовать, проектировать здания и узнавать больше о современных технологиях. Надеюсь, что поступлю в хороший университет и стану настоящим специалистом.", "B1", "О себе" },
                    { 44, "Russian", "В прошлые выходные я наконец решил съездить в Санкт-Петербург. Я давно хотел это сделать, но всё откладывал. А ведь добраться туда совсем несложно — поездка на «Сапсане» занимает всего около четырёх часов. Расстояние между Москвой и Петербургом — примерно семьсот километров. Раньше, когда я был школьником, мы ездили туда на поезде всей ночью, и это казалось настоящим путешествием.\r\n\r\nВ среду вечером я купил билеты на сайте РЖД — туда и обратно за шесть с половиной тысяч рублей. Поездка была запланирована на пятницу. Я заранее договорился с начальником, чтобы уйти с работы немного раньше. Приехал на Ленинградский вокзал за полчаса до отправления и спокойно сел в поезд.\r\n\r\nСанкт-Петербург встретил меня прохладной, но солнечной погодой. Я провёл два дня в этом прекрасном городе. Успел погулять по Невскому проспекту, сходить в Эрмитаж, посмотреть на развод мостов ночью и даже покататься на теплоходе по каналам. Атмосфера города, его архитектура и уютные кофейни сделали мой уикенд особенным.\r\n\r\nВ воскресенье вечером я вернулся домой немного уставшим, но очень довольным. Теперь точно знаю — такие поездки нужно устраивать почаще.", "B1", "Незабываемые выходные в Санкт-Петербурге" },
                    { 45, "Russian", "После нескольких месяцев поиска работы и отправки резюме я наконец получил приглашение на должность в IT-компанию, занимающуюся разработкой мобильных приложений. Я давно интересовался этой сферой, поэтому был невероятно рад, когда мне сообщили, что я принят.\r\n\r\nВ первый день я проснулся пораньше, чтобы не опоздать. Я выбрал спокойный, но аккуратный наряд, так как в IT-среде нет строгого дресс-кода. Офис находился в современном здании в центре города. Просторные светлые помещения, удобные рабочие зоны и дружелюбная атмосфера сразу произвели на меня хорошее впечатление.\r\n\r\nМеня встретила менеджер по персоналу и провела краткую экскурсию по офису. Затем я познакомился с моей командой – это были молодые специалисты, увлечённые своим делом. Моим наставником стал старший разработчик по имени Андрей. Он сразу предложил помощь и объяснил, чем я буду заниматься в ближайшее время.\r\n\r\nВ первый день мне дали несколько несложных заданий, чтобы я смог освоиться с внутренними инструментами и подходом к работе. Я также поучаствовал во встрече команды, где обсуждались текущие проекты. Всё происходило в неформальной и уважительной обстановке, что очень меня порадовало.\r\n\r\nПосле работы коллеги пригласили меня поужинать в кафе недалеко от офиса. Это была отличная возможность лучше узнать друг друга и почувствовать себя частью коллектива. Я ушёл домой с ощущением, что сделал правильный выбор и впереди меня ждёт интересная профессиональная жизнь.", "B2", "Первый рабочий день в новой компании" },
                    { 46, "Russian", "Привет, Алексей!\r\n\r\nЯ был очень рад получить твоё письмо. Здорово, что у тебя всё хорошо и что ты наконец-то завершил ремонт в квартире. Представляю, сколько это заняло времени и сил. Надеюсь, теперь вы с Олей сможете немного отдохнуть и подумать о путешествии.\r\n\r\nЕсли вы всё же решите приехать летом в Казань, мы с удовольствием примем вас у себя. У нас просторная квартира, и для вас найдётся отдельная комната. Мы уже продумываем, куда можно будет сходить вместе. Первым делом, конечно, стоит посетить Казанский Кремль. Это не только исторический центр города, но и место с потрясающими видами на Волгу.\r\n\r\nОбязательно покажем вам улицу Баумана – это наша пешеходная зона, полная кафе, сувенирных лавок и уличных артистов. Также можно съездить на озеро Кабан, покататься на катамаране или просто прогуляться по набережной. Если захотите узнать больше о местной культуре, заглянем в Национальный музей Татарстана.\r\n\r\nНу а если вы приедете в июле, попадёте на фестиваль татарской культуры «Сабантуй» – будет весело и вкусно. Поверь, ты точно не останешься равнодушным к нашей кухне: эчпочмаки, чак-чак, кыстыбый – всё это стоит попробовать.\r\n\r\nЖду от тебя весточки. Напиши, как только определитесь с планами.\r\n\r\nТвой друг,\r\nМихаил", "B2", "Письмо другу" },
                    { 47, "Russian", "Прошлый год стал для меня важным этапом: я закончил магистратуру и получил диплом. Теперь я готов строить свою профессиональную карьеру. Мне удалось устроиться в международную компанию на должность младшего аналитика. Работа интересная, но требует постоянного развития, поэтому в ближайшие месяцы я собираюсь пройти курсы повышения квалификации.\r\n\r\nОдной из главных целей на ближайшее будущее является переезд в собственное жильё. Сейчас я живу на съёмной квартире, но уже начал откладывать деньги на первый взнос по ипотеке. Планирую купить однокомнатную квартиру в новом районе с хорошей инфраструктурой. Надеюсь, что за год смогу накопить нужную сумму.\r\n\r\nКроме того, хочу больше путешествовать. Пока что был только в паре стран Европы, но мечтаю увидеть Азию – особенно Японию и Южную Корею. Планирую взять отпуск в следующем году и отправиться туда хотя бы на две недели.\r\n\r\nЯ понимаю, что все эти цели требуют времени, дисциплины и финансов, но я настроен решительно. Уверен, что при достаточной настойчивости смогу всё реализовать.", "B2", "Планы на будущее" },
                    { 48, "Russian", "Жить в мегаполисе – это, безусловно, интересный и насыщенный опыт. Большой город предоставляет множество возможностей: здесь легче найти работу, получить качественное образование, познакомиться с новыми людьми и попробовать себя в разных сферах жизни.\r\n\r\nС одной стороны, в мегаполисе всё находится рядом – магазины, культурные мероприятия, спортзалы, кафе, театры. Благодаря развитой инфраструктуре можно быстро добраться из одной части города в другую. Особенно это удобно для тех, кто ценит время и активный образ жизни.\r\n\r\nОднако у жизни в большом городе есть и свои минусы. Пробки на дорогах, высокий уровень шума и загрязнённый воздух могут негативно влиять на здоровье и настроение. Кроме того, из-за большого количества людей не всегда легко почувствовать себя в безопасности и расслабиться. Часто у горожан возникает чувство усталости и хронического стресса.\r\n\r\nНесмотря на трудности, многие не представляют свою жизнь вне большого города. Он даёт ощущение движения вперёд, вдохновляет развиваться и не останавливаться на достигнутом. Главное – уметь находить баланс между работой и отдыхом, чтобы жизнь в мегаполисе приносила радость, а не только усталость.", "B2", "Жизнь в большом городе" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Texts",
                keyColumn: "Id",
                keyValue: 48);
        }
    }
}
